# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
#  и проверяет, является ли этот день выходным
num = int(input('Введите номер дня недели:'))
if num <= 5:
    print(f"{num} - рабочий день")
else:
    print(f"{num} - выходной день")


# Напишите программу для. проверки истинности утверждения
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
